[{"title":"No More Lucio Glitches for Overwatch","body":"Overwatch’s Lucioball mode is all fun and games until D.Va or Widowmaker shows up, and somebody loses an eye. <br> <br> Or a head. It’s a bizarre glitch, and Blizzard has some advice for people taking advantage of it: don’t. <br> <br> What began as something of a funny prank has turned into a game-breaking exploit. <br> <br> Some people have figured out how to reliably make the glitch occur, and Blizzard isn’t cool with that. <br> <br> In a forum post, game director Jeff Kaplan explained: 'Apologies for this bug. <br> <br> We’ve attempted to fix it numerous times and have had unrelated issues preventing the fix. <br> <br> We hope to have a fix this week. In the meantime, we are in discussions with our Customer Support group to start taking action against those deliberately using the bug to play heroes other than Lucio. <br> <br> Please do not exploit this bug. Fair warning.' <br> <br> So yeah, in case it wasn’t already clear, Lucioball is short for 'Luci-only-oball,' <br> <br>  which would be a very bad name for anything. <br> <br> Other heroes will just have to wait for their own sports, like Reinhardt Croquet, The Genji vs Tracer Ass-Olympics, and Sweaty Short-Shorts-Wearing Badminton On A Sunny Country Club Court Starring Reaper. <br> <br> Article written by Nathan Grayson from Kotaku.com"},{"title":"No More Pokemon Go At Hiroshima Museum","body":"After requests from Hiroshima officials, Niantic removed Pokémon, PokéStops and Pokémon Go gyms from Hiroshima Memorial Park before the annual ceremony of city’s bombing last weekend, the AP reports. <br> <br> It is the 71st anniversary of US attack on Hiroshima, in which 140,000 were killed. Late July, in preparation for the city’s memorial event, Hiroshima officials asked Niantic to remove the park’s reported 30 PokéStops and three gyms.<br> <br>  Since the game’s release, players have haunted the memorial searching for Pokémon, which officials found disruptive to the somber atmosphere, which last year attracted nearly 1.5 million visitors. <br> <br> Niantic removed the PokéStops and gyms from the Hiroshima Memorial Park last Thursday, but Pokémon still wandered the grounds. <br> <br> The AP reports that, at 1:56 a.m., Niantic responded to Hiroshima officials’ requests to remove the Pokémon. <br> <br> The ceremony transpired six hours later. According to Japan Today, Niantic has also abided by Nagasaki officials’ requests for Pokémon Go-related content to be removed from the Nagasaki Peace Park, which commemorates the city’s August 1945 bombing.<br> <br>  Late July, players were also asked to avoid catching Pokemon around the Fukushima Daiichi nuclear power plant. Pokémon Go-related breaches of decorum have plagued sensitive sites in America, too, though Niantic appears to be respecting the wishes of these sites’ curators. <br> <br> Recently, Pokémon were removed from the Holocaust Museum in Washington, D.C., where, for some reason, players had to be told to stop chasing Pidgeys between the museum’s exhibits honoring those who died in concentration camps.<br> <br>  Article written by Cecilia D'Anastasio from Kotaku.com"},{"title":"Nintendo Shuts Down Metroid 2 Remake","body":"This weekend, the long in-development fan project Another Metroid 2 Remake (AM2R) was released on PC, and Nintendo is shutting it down its distribution on filesharing sites. <br> <br> AM2R is a remake of Metroid II: The Return of Samus, a sequel to the popular Metroid on NES, which Nintendo released on the Game Boy back in in 1991. The fan remake, in development since 2012, adds improved sprite graphics and new gameplay in the style of Metroid Zero Mission -- a remake released by Nintendo -- on the Game Boy Advance. Released on August 6, and just in time for Metroid’s 30th anniversary, filesharing sites hosting AM2R were notified to remove the game by Nintendo’s legal counsel according to Polygon. The unapproved use of Nintendo’s intellectual property can weaken our ability to protect and preserve it. 'Nintendo’s broad library of characters, products, and brands are enjoyed by people around the world, and we appreciate the passion of our fans,' reads a statement provided to IGN by a Nintendo representative. 'But just as Nintendo respects the intellectual property rights of others, we must also protect our own characters, trademarks and other content. The unapproved use of Nintendo’s intellectual property can weaken our ability to protect and preserve it, or to possibly use it for new projects.' <br> <br> As of this writing the free .zip file is currently unavailable to download, but passionate fans have started a torrent up to keep the Metroid fan remake project alive. <br> <br> Nintendo has shut down several fan-related projects due to copyright infringement including a browser-friendly 3D homage to the Legend of Zelda, an NES visual compendium, and a Metroid Fan film subtitled Enemies Within. Article by Jose Otero from IGN.com"}]